app/Http/Controllers/ProductController.php

select * from `products`
select `weather`.*, `product_weather`.`product_id` as `pivot_product_id`, `product_weather`.`weather_id` as `pivot_weather_id` from `weather` inner join `product_weather` on `weather`.`id` = `product_weather`.`weather_id` where `product_weather`.`product_id` in (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50)
---
    public function getByWeatherConditions(string $city)
    {
        try {
            $request = Http::get("https://api.meteo.lt/v1/places/{$city}/forecasts/long-term/")
                ->json();
        } catch (Exception $e) {
            throw new \Exception($e->getCode());
        }

        //current date +3 days
        $maxDate = Carbon::now()->addDays(3)->format('Y-m-d');

        $conditions = collect();
        foreach ($request['forecastTimestamps'] as $timestamp) {
            $date = substr($timestamp['forecastTimeUtc'], 0, 10);
            if (!$conditions->has($date) && $date < $maxDate) {
                $conditions->put($date, ['code' => $timestamp['conditionCode'], 'date' => $date]);
            }
        }

        return response()->json([
            'weather_data_source' => 'https://api.meteo.lt/',
            'city' => $city,
            'recommendations' => $conditions->map(fn($condition) => [
                'weather_forecast' => $condition['code'],
                'date' => $condition['date'],
                'products' => Product::with('weather')
                    ->get()
                    ->filter(function ($product) use ($condition) {
                        return $product->weather->firstWhere('condition', $condition['code']) != null;
                    })->slice(0, 2)
                    ->map(fn($product) => [
                        'sku' => $product->sku,
                        'name' => $product->name,
                        'price' => $product->price / 100
                    ])